/**

有三个色子上面有1~6数字，输出所有可能性，注：121,112,211为同一种可能性

**/

//思路：1.产生数字，将其保存到一个数组中
//     2.产生的数字在数组中进行查重

//先把所有情况输出一遍吧
//第一个产生数字好像很简单哦，就for循环
var nums= [];
for(var i=1; i<=6; i++){
    for(var j=1; j<=6; j++){
        for(var k=1; k<=6; k++){
            nums.push(parseInt(""+i+""+j+""+k))
        }       
    }
}
console.log(nums,nums.length);
/**
 * 
 * [111, 112, 113, 114, 115, 116, 121, 122, 123, 124, 125, 126, 131, 132, 133, 134, 135, 136, 141, 142, 143, 144, 145, 146, 151, 152, 153, 154, 155, 156, 161, 162, 163, 164, 165, 166, 211, 212, 213, 214, 215, 216, 221, 222, 223, 224, 225, 226, 231, 232, 233, 234, 235, 236, 241, 242, 243, 244, 245, 246, 251, 252, 253, 254, 255, 256, 261, 262, 263, 264, 265, 266, 311, 312, 313, 314, 315, 316, 321, 322, 323, 324, 325, 326, 331, 332, 333, 334, 335, 336, 341, 342, 343, 344, 345, 346, 351, 352, 353, 354…]
 * 216
 * 总共有216个
 * 靠你现在就会写了，面试的时候怎么连这个都写不出啊，尼玛，傻不拉几的
 */

//然后就是添加查重功能的，好像很简单的样子～～～
//每产生一个数字就将其所有的可能遍历出来，然后查找一下数组里面有没有
//好像很有道理的感觉哦，是吧，尼玛，傻不拉几的，虽然最后可以行的通，但是，你看不出有规律的吗
//面试之后，面试官说有规律的，真的看不出啊


//为什么，因为你查重的想法想错了，如：112,121,211 | 123，132，213,231,312，321
//看出有什么规律了吗？？


//看不出吗？？？傻不拉几的的，你没看到所有的数字如果按照从小到大排序的话，都是一个数字吗？？
//第一种：112 第二种：123，所以查重的时候要先进行排序之后在进行查重

//从小到大排序就能够保证生成的数字都是唯一的，懂吗？所以直接写

var nums= [];
for(var i=1; i<=6; i++){
    for(var j=1; j<=6; j++){
        for(var k=1; k<=6; k++){
            //看得懂这里是为什么吗？？？
            //想一下是从最大的数字开始生成的，666,656...656的时候第二位数是小于第一位数的，不符合我们的要求，
            //所以我们要判断小于第一位数的那些数字不进行生成，if(j<i||k<j)，反过来就是 if(j>i || k >j)
            //懂了吗？
            if(j>i||k>j){
                continue;
            }
            nums.push(parseInt(""+i+""+j+""+k))
        }       
    }
}
console.log(nums,nums.length);


/**
 * [111, 211, 221, 222, 311, 321, 322, 331, 332, 333, 411, 421, 422, 431, 432, 433, 441, 442, 443, 444, 511, 521, 522, 531, 532, 533, 541, 542, 543, 544, 551, 552, 553, 554, 555, 611, 621, 622, 631, 632, 633, 641, 642, 643, 644, 651, 652, 653, 654, 655, 661, 662, 663, 664, 665, 666] 
 * 56
 */






